InformationRegisters/pcru_ex_СопоставлениеВнешнихДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>pcru_ex_СопоставлениеВнешнихДанных</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыНачисленийОплатыТрудаДляНУ</v8:Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВБухУчете</v8:Type>
						<v8:Type>cfg:CatalogRef.ПрочиеДоходыИРасходы</v8:Type>
						<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоЗарплате</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.БНФОСчетаАналитическогоУчета</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.pcru_ex_ТипыВнешнихДанных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодВнешнихДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/pcru_ex_СопоставлениеВнешнихДанных/Ext/ManagerModule.bsl
// Сопоставляет данные по регистру
//
// Параметры:
//  НаименованиеДанных  - Строка - Имя типа данных
//                 например "ВидНачисленияОплатыТрудаДляНУ"
//  КодВнешнихДанных  - Строка - Код для сопоставления
//                 
//
// Возвращаемое значение:
//   Сопоставленное значение(Ссылка), Неопределено(Если не сопоставилось)
//
Функция СопоставитьДанные(НаименованиеДанных,КодВнешнихДанных)Экспорт
	//*********************************************************************** 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	pcru_ex_ТипыВнешнихДанных.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.pcru_ex_ТипыВнешнихДанных КАК pcru_ex_ТипыВнешнихДанных
	               |ГДЕ
	               |	pcru_ex_ТипыВнешнихДанных.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Наименование",НаименованиеДанных);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
	  ТипДанных = Выборка.Ссылка;
	Иначе	
		НовыйТипДанных = Справочники.pcru_ex_ТипыВнешнихДанных.СоздатьЭлемент();
		НовыйТипДанных.Наименование = НаименованиеДанных;
		НовыйТипДанных.Записать();
		ТипДанных = НовыйТипДанных.Ссылка;
	КонецЕсли;   	 
	//*********************************************************************** 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	pcru_ex_СопоставлениеВнешнихДанных.Значение КАК Значение
	               |ИЗ
	               |	РегистрСведений.pcru_ex_СопоставлениеВнешнихДанных КАК pcru_ex_СопоставлениеВнешнихДанных
	               |ГДЕ
	               |	pcru_ex_СопоставлениеВнешнихДанных.КодВнешнихДанных = &КодВнешнихДанных
	               |	И pcru_ex_СопоставлениеВнешнихДанных.ТипДанных = &ТипДанных";
	Запрос.УстановитьПараметр("КодВнешнихДанных", КодВнешнихДанных);
	Запрос.УстановитьПараметр("ТипДанных",ТипДанных );
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
	   Возврат Выборка.Значение;
	КонецЦикла;
	Возврат Неопределено;
	//*********************************************************************** 
КонецФункции // ()
